#ifndef BIGHEXCONFIG_H_INCLUDED
#define BIGHEXCONFIG_H_INCLUDED

axval bodysize={186,50,390};

axval L[3]={                               //размеры звеньев ноги
            {52, 10, 50},
            {82, 10, 50},
            {142,10,50}
            };
axval o[3][6];                                    //координаты центров
axval ang[3][6]={                                  //углы наклона звеньев
                 {{0,0,0},{-0,0,0},{-45,0,0},{45,0,0},{45,0,0},{-45,0,0}},            //вращательные звенья
                 {{0,0,-0},{0,0,0},{0,0,-0},{0,0,-0},{0,0,0},{0,0,0}},     //первое поступательное
                 {{0,0,90},{0,0,-90},{0,0,90},{0,0,90},{0,0,-90},{0,0,-90}}
                 };
leg_angles step_angles[2][500];  //[0][i] grad; [1][i] micrisec
//начало блока задания постоянных для физического гексопода
float I0[6][3]={{1472, 1472, 1650},  //нулевые значения серводвигателей (посередине)
               {1472, 1472, 1472},
               {1000, 1472, 1472},
               {1400, 1472, 1472},
               {2100, 1472, 1650},
               {950, 1472, 1550}};
float dir[6][3]={
                {-1,-1,-1}, //направление отсчета угла от нулевого значения (1 - в сторону увеличения, 2 - уменьшения)
                {1,-1,1},
                {1,-1,-1},
                {-1,-1,-1},
                {1,-1,-1},
                {1,-1,-1}};

extreme_values servo_border[6][3]={                             //крайние значения поворота серводвигателей
                                {{600,2300},{600,2300},{1200,2000}},
                                {{600,2300},{600,2300},{1200,1700}},
                                {{600,2300},{600,2300},{1200,2000}},
                                {{600,2300},{600,2300},{1200,2000}},
                                {{600,2300},{600,2300},{1200,2000}},
                                {{600,2300},{600,2300},{1200,2000}},
                                };
int pin[6][3]={
              {16,17,18},//средняя правая
               {10,11,12},//левая средняя
               {4,5,6},  //правая передняя
               {13,14,15},//правая задняя
               {7,8,9},  //левая задняя
               {19,2,3}, //левая передняя
               };
float dcenleg=34;
//int dcenleg=20;
float steptime=2000;
#endif // BIGHEXCONFIG_H_INCLUDED
