#ifndef BIGHEXCONFIG_H_INCLUDED
#define BIGHEXCONFIG_H_INCLUDED

axval bodysize={186,50,390};

axval L[3]={                               //размеры звеньев ноги
            {52, 30, 50},
            {82, 30, 50},
            {142, 30,50}
            };
axval o[3][6];                                    //координаты центров
axval ang[3][6]={                                  //углы наклона звеньев
                 {{0,0,0},{-0,0,0},{-45,0,0},{45,0,0},{45,0,0},{-45,0,0}},            //вращательные звенья
                 {{0,0,-0},{0,0,0},{0,0,-0},{0,0,-0},{0,0,0},{0,0,0}},     //первое поступательное
                 {{0,0,90},{0,0,-90},{0,0,90},{0,0,90},{0,0,-90},{0,0,-90}}
                 };
leg_angles step_angles[2][500];  //[0][i] grad; [1][i] micrisec
//начало блока задания постоянных для физического гексопода
int I0[6][3]={{1472, 1472, 1472},  //нулевые значения серводвигателей (посередине)
               {1472, 1472, 1472},
               {1472, 1472, 1472},
               {1472, 1472, 1472},
               {1472, 1472, 1472},
               {1472, 1472, 1472}};
int dir[6][3]={ {1,1,1}, //направление отсчета угла от нулевого значения (1 - в сторону увеличения, 2 - уменьшения)
                {1,1,1},
                {1,1,1},
                {1,1,1},
                {1,1,1},
                {1,1,1}};

extreme_values servo_border[6][3]={                             //крайние значения поворота серводвигателей
                                {{600,2300},{600,2300},{1000,2300}},
                                {{600,2300},{600,2300},{1000,2300}},
                                {{600,2300},{600,2300},{1000,2300}},
                                {{600,2300},{600,2300},{1000,2300}},
                                {{600,2300},{600,2300},{1000,2300}},
                                {{600,2300},{600,2300},{1000,2300}},
                                };
int pin[6][3]={
               {24,25,26},
               {1,2,3},
               {4,5,6},
               {7,8,9},
               {10,11,12},
               {13,14,15},
               };
int dcenleg=34;
int steptime=800;
#endif // BIGHEXCONFIG_H_INCLUDED
