#ifndef LITTLEHEXCONFIG_H_INCLUDED
#define LITTLEHEXCONFIG_H_INCLUDED

int steptime=1;
axval bodysize={250,50,460};
float dcenleg=80;
axval L[3]={                               //размеры звеньев ноги
            {70, 10, 80},
            {100, 10, 80},
            {180, 10, 80}
            };
axval o[3][6];                                    //координаты центров
axval ang[3][6]={                                  //углы наклона звеньев
                 {{0,0,0},{-0,0,0},{-45,0,0},{45,0,0},{45,0,0},{-45,0,0}},            //вращательные звенья
                 {{0,0,-0},{0,0,0},{0,0,-0},{0,0,-0},{0,0,0},{0,0,0}},     //первое поступательное
                 {{0,0,90},{0,0,-90},{0,0,90},{0,0,90},{0,0,-90},{0,0,-90}}
                 };
leg_angles step_angles[2][500];  //[0][i] grad; [1][i] micrisec
//начало блока задания постоянных для физического гексопода
float I0[6][3]={{1472, 1472, 1472},  //нулевые значения серводвигателей (посередине)
               {1472, 1472, 1472},
               {1878, 1609, 1472},
               {944, 1472, 1472},
               {1922, 1472, 1472},
               {1022, 1472, 1472}};
float dir[6][3]={ {-1,-1,1}, //направление отсчета угла от нулевого значения (1 - в сторону увеличения, 2 - уменьшения)
                {1,1,-1},
                {-1,-1,1},
                {-1,-1,1},
                {1,1,-1},
                {1,1,-1}};

extreme_values servo_border[6][3]={                             //крайние значения поворота серводвигателей
                                {{600,2300},{600,2300},{1000,2300}},
                                {{600,2300},{600,2300},{1000,2300}},
                                {{600,2300},{600,2300},{1000,2300}},
                                {{600,2300},{600,2300},{1000,2300}},
                                {{600,2300},{600,2300},{1000,2300}},
                                {{600,2300},{600,2300},{1000,2300}},
                                };
int pin[6][3]={
              /* {38,39,40},//средняя правая
               {32,33,34},//левая средняя
               {25,26,27},  //правая передняя
               {35,36,37},//правая задняя
               {28,30,31},  //левая задняя
               {22,23,24}, //левая передняя*/
               {16,17,18},//средняя правая
               {10,11,12},//левая средняя
               {4,5,6},  //правая передняя
               {13,14,15},//правая задняя
               {7,8,9},  //левая задняя
               {1,2,3}, //левая передняя
               };

#endif // LITTLEHEXCONFIG_H_INCLUDED
