#ifndef LITTLEHEXCONFIG_H_INCLUDED
#define LITTLEHEXCONFIG_H_INCLUDED

int steptime=800;
axval bodysize={250,50,460};
int dcenleg=80;
axval L[3]={                               //размеры звеньев ноги
            {70, 30, 80},
            {100, 30, 80},
            {180, 30, 80}
            };
axval o[3][6];                                    //координаты центров
axval ang[3][6]={                                  //углы наклона звеньев
                 {{0,0,0},{-0,0,0},{-45,0,0},{45,0,0},{45,0,0},{-45,0,0}},            //вращательные звенья
                 {{0,0,-0},{0,0,0},{0,0,-0},{0,0,-0},{0,0,0},{0,0,0}},     //первое поступательное
                 {{0,0,90},{0,0,-90},{0,0,90},{0,0,90},{0,0,-90},{0,0,-90}}
                 };
leg_angles step_angles[2][500];  //[0][i] grad; [1][i] micrisec
//начало блока задания постоянных для физического гексопода
int I0[6][3]={{1472, 1472, 1472},  //нулевые значения серводвигателей (посередине)
               {1472, 1472, 1472},
               {1472, 1472, 1472},
               {1472, 1472, 1472},
               {1472, 1472, 1472},
               {1472, 1472, 1472}};
int dir[6][3]={ {-1,-1,1}, //направление отсчета угла от нулевого значения (1 - в сторону увеличения, 2 - уменьшения)
                {1,1,-1},
                {-1,-1,1},
                {-1,-1,1},
                {1,1,-1},
                {1,1,-1}};

extreme_values servo_border[6][3]={                             //крайние значения поворота серводвигателей
                                {{600,2300},{600,2300},{1000,2300}},
                                {{600,2300},{600,2300},{1000,2300}},
                                {{600,2300},{600,2300},{1000,2300}},
                                {{600,2300},{600,2300},{1000,2300}},
                                {{600,2300},{600,2300},{1000,2300}},
                                {{600,2300},{600,2300},{1000,2300}},
                                };
int pin[6][3]={
               {24,25,26},//средняя правая
               {1,2,3},//левая средняя
               {4,5,6},//правая передняя
               {7,8,9},//правая задняя
               {10,11,12},//левая задняя
               {13,14,15},//левая передняя
               };

#endif // LITTLEHEXCONFIG_H_INCLUDED
